[
    {
      "category": "hadiths",
      "entries": [
        {
          "text": "La quête de la science est une obligation pour tout musulman.",
          "source": "Sunan Ibn Majah, Livre 1, Hadith 224"
        },
        {
          "text": "Les meilleurs d'entre vous sont ceux qui apprennent le Coran et l'enseignent.",
          "source": "Sahih al-Bukhari, Livre 61, Hadith 545"
        },
        {
          "text": "Lorsque l'homme meurt, ses actions prennent fin sauf dans trois cas : une aumône continue, un savoir bénéfique ou un enfant pieux qui prie pour lui.",
          "source": "Sahih Muslim, Livre 25, Hadith 4223"
        },
        {
          "text": "Quiconque emprunte un chemin à la recherche du savoir, Allah lui facilite un chemin vers le Paradis.",
          "source": "Sunan Abu Dawood, Livre 25, Hadith 3634"
        },
        {
          "text": "Les savants sont les héritiers des Prophètes.",
          "source": "Jami` at-Tirmidhi, Livre 41, Hadith 2682"
        },
        {
          "text": "Transmettez de moi, ne serait-ce qu'un verset.",
          "source": "Sahih al-Bukhari, Livre 61, Hadith 57"
        },
        {
          "text": "Le croyant ne se lasse jamais de faire le bien jusqu'à ce qu'il atteigne le Paradis.",
          "source": "Jami` at-Tirmidhi, Livre 42, Hadith 2637"
        },
        {
          "text": "La sagesse est la propriété perdue du croyant. Où qu'il la trouve, il en est le plus digne.",
          "source": "Jami` at-Tirmidhi, Livre 41, Hadith 2687"
        },
        {
          "text": "Allah ne retire pas la science en l’ôtant des cœurs des hommes, mais Il la retire en retirant les savants.",
          "source": "Sahih al-Bukhari, Livre 3, Hadith 85"
        }
      ]
    },
    {
      "category": "verses",
      "entries": [
        {
          "text": "Lis, au nom de ton Seigneur qui a créé.",
          "source": "Sourate Al-'Alaq 96:1"
        },
        {
          "text": "Dis : 'Sont-ils égaux, ceux qui savent et ceux qui ne savent pas ?'",
          "source": "Sourate Az-Zumar 39:9"
        },
        {
          "text": "Allah élèvera en degrés ceux d’entre vous qui auront cru et ceux qui auront reçu le savoir.",
          "source": "Sourate Al-Mujadila 58:11"
        },
        {
          "text": "Et Il apprit à Adam tous les noms.",
          "source": "Sourate Al-Baqarah 2:31"
        },
        {
          "text": "Mon Seigneur, augmente-moi en savoir.",
          "source": "Sourate Taha 20:114"
        },
        {
          "text": "Et ne cachez pas le savoir, car celui qui le cache verra son cœur marqué au fer rouge le Jour de la Résurrection.",
          "source": "Sourate Al-Baqarah 2:159"
        }
      ]
    }
  ]
  