[
    {
        "_id": 1,
        "_student_id": 6,
        "_subject_id": 1,
        "_date": "2025-03-15",
        "_content": "Élève sérieux et appliqué en Quran, toujours concentré en classe. Les devoirs sont bien faits et rendus à temps. Continue ainsi, tes efforts portent leurs fruits !"
    },
    {
        "_id": 2,
        "_student_id": 6,
        "_subject_id": 2,
        "_date": "2025-03-01",
        "_content": "Élève qui montre de l'intérêt en Tajwid, mais parfois distrait. Les devoirs sont faits, mais pourraient être plus soignés. Concentre-toi davantage pour améliorer tes résultats !"
    },
    {
        "_id": 3,
        "_student_id": 7,
        "_subject_id": 1,
        "_date": "2025-03-08",
        "_content": "Élève qui montre de l'intérêt en Quran, mais parfois distrait en classe. Les devoirs sont souvent faits, mais il manque de régularité. Ne relâche pas tes efforts, c'est un bon début !"
    },
    {
        "_id": 4,
        "_student_id": 7,
        "_subject_id": 1,
        "_date": "2025-02-23",
        "_content": "Élève appliqué en Nourania, avec de bons progrès. Les devoirs sont bien faits, et les résultats sont encourageants. Continue sur cette lancée !"
    },
    {
        "_id": 5,
        "_student_id": 8,
        "_subject_id": 1,
        "_date": "2025-02-22",
        "_content": "Élève très concentré et participatif en Quran. Les devoirs sont toujours bien faits, et les résultats sont excellents. Continue sur cette voie !"
    },
    {
        "_id": 6,
        "_student_id": 8,
        "_subject_id": 2,
        "_date": "2025-03-02",
        "_content": "Élève sérieux en Éveil à la Foi, mais les devoirs pourraient être plus approfondis. Tes résultats sont corrects, continue à travailler pour progresser davantage !"
    },
    {
        "_id": 7,
        "_student_id": 9,
        "_subject_id": 1,
        "_date": "2025-03-15",
        "_content": "Élève exemplaire en Quran, très sérieux et appliqué. Les devoirs sont toujours rendus à temps et bien faits. Tes performances sont impressionnantes, bravo !"
    },
    {
        "_id": 8,
        "_student_id": 9,
        "_subject_id": 2,
        "_date": "2025-02-19",
        "_content": "Élève appliqué en Langue Arabe, avec de bons résultats. Les devoirs sont bien faits, et tu montres une bonne attitude en classe. Continue ainsi !"
    },
    {
        "_id": 9,
        "_student_id": 10,
        "_subject_id": 2,
        "_date": "2025-02-22",
        "_content": "Élève qui a du potentiel en Tajwid, mais manque de concentration en classe. Les devoirs sont parfois négligés, ce qui impacte tes résultats. Concentre-toi davantage !"
    },
    {
        "_id": 10,
        "_student_id": 10,
        "_subject_id": 1,
        "_date": "2025-03-02",
        "_content": "Élève qui rencontre des difficultés en Nourania, mais montre de l'effort. Les devoirs sont faits, mais il faut plus de pratique. Ne relâche pas tes efforts, c'est un bon début !"
    },
    {
        "_id": 11,
        "_student_id": 11,
        "_subject_id": 2,
        "_date": "2025-03-01",
        "_content": "Élève très sérieux et attentif en Tajwid. Les devoirs sont toujours bien faits, et les progrès sont remarquables. Continue ainsi, tu es sur la bonne voie !"
    },
    {
        "_id": 12,
        "_student_id": 11,
        "_subject_id": 2,
        "_date": "2025-02-16",
        "_content": "Élève appliqué en Éveil à la Foi, avec de bons résultats. Les devoirs sont bien faits, et tu participes activement. Continue sur cette lancée !"
    },
    {
        "_id": 13,
        "_student_id": 12,
        "_subject_id": 2,
        "_date": "2025-03-08",
        "_content": "Élève qui peut être distrait en Tajwid. Les devoirs sont faits, mais manquent parfois de soin. Tes résultats pourraient être meilleurs avec plus d'efforts. Continue à travailler !"
    },
    {
        "_id": 14,
        "_student_id": 12,
        "_subject_id": 2,
        "_date": "2025-03-05",
        "_content": "Élève qui montre de l'intérêt en Langue Arabe, mais manque de régularité dans les devoirs. Concentre-toi davantage pour améliorer tes résultats !"
    },
    {
        "_id": 15,
        "_student_id": 13,
        "_subject_id": 1,
        "_date": "2025-02-23",
        "_content": "Élève appliqué et concentré en Nourania. Les devoirs sont bien faits, et les progrès sont visibles. Continue sur cette lancée, tes efforts sont récompensés !"
    },
    {
        "_id": 16,
        "_student_id": 13,
        "_subject_id": 2,
        "_date": "2025-03-02",
        "_content": "Élève sérieux en Éveil à la Foi, mais les devoirs pourraient être plus soignés. Tes résultats sont corrects, continue à travailler pour progresser !"
    },
    {
        "_id": 17,
        "_student_id": 14,
        "_subject_id": 1,
        "_date": "2025-03-09",
        "_content": "Élève sérieux et attentif en Nourania. Les devoirs sont toujours rendus à temps, et les résultats sont très bons. Continue ainsi, c'est excellent !"
    },
    {
        "_id": 18,
        "_student_id": 14,
        "_subject_id": 2,
        "_date": "2025-02-26",
        "_content": "Élève appliqué en Langue Arabe, avec de bons résultats. Les devoirs sont bien faits, et tu montres une bonne attitude en classe. Continue sur cette voie !"
    },
    {
        "_id": 19,
        "_student_id": 15,
        "_subject_id": 2,
        "_date": "2025-02-16",
        "_content": "Élève qui montre de l'intérêt en Éveil à la Foi, mais manque parfois de concentration. Les devoirs sont faits, mais pourraient être plus soignés. Ne relâche pas tes efforts !"
    },
    {
        "_id": 20,
        "_student_id": 15,
        "_subject_id": 2,
        "_date": "2025-03-12",
        "_content": "Élève appliqué en Langue Arabe, avec de bons résultats. Les devoirs sont bien faits, et tu progresses bien. Continue ainsi, c'est encourageant !"
    },
    {
        "_id": 21,
        "_student_id": 16,
        "_subject_id": 2,
        "_date": "2025-03-02",
        "_content": "Élève très appliqué et concentré en Éveil à la Foi. Les devoirs sont toujours bien faits, et les résultats sont excellents. Continue sur cette voie !"
    },
    {
        "_id": 22,
        "_student_id": 16,
        "_subject_id": 1,
        "_date": "2025-03-01",
        "_content": "Élève sérieux en Quran, mais les devoirs pourraient être plus approfondis. Tes résultats sont corrects, continue à travailler pour progresser davantage !"
    },
    {
        "_id": 23,
        "_student_id": 17,
        "_subject_id": 2,
        "_date": "2025-03-08",
        "_content": "Élève sérieux et attentif en Tajwid. Les devoirs sont bien faits, et les résultats sont corrects. Continue à travailler pour progresser davantage !"
    },
    {
        "_id": 24,
        "_student_id": 17,
        "_subject_id": 2,
        "_date": "2025-03-19",
        "_content": "Élève appliqué en Langue Arabe, avec de bons résultats. Les devoirs sont bien faits, et tu progresses bien. Continue ainsi, c'est encourageant !"
    },
    {
        "_id": 25,
        "_student_id": 18,
        "_subject_id": 2,
        "_date": "2025-03-05",
        "_content": "Élève qui a du potentiel en Langue Arabe, mais manque de régularité dans les devoirs. Concentre-toi davantage pour améliorer tes résultats !"
    },
    {
        "_id": 26,
        "_student_id": 18,
        "_subject_id": 1,
        "_date": "2025-02-16",
        "_content": "Élève appliqué en Nourania, avec de bons résultats. Les devoirs sont bien faits, et tu progresses bien. Continue sur cette lancée !"
    },
    {
        "_id": 27,
        "_student_id": 19,
        "_subject_id": 2,
        "_date": "2025-03-12",
        "_content": "Élève exemplaire en Langue Arabe, très appliqué et concentré. Les devoirs sont toujours bien faits, et les résultats sont excellents. Bravo, continue ainsi !"
    },
    {
        "_id": 28,
        "_student_id": 19,
        "_subject_id": 2,
        "_date": "2025-02-26",
        "_content": "Élève sérieux en Éveil à la Foi, avec de bons résultats. Les devoirs sont bien faits, et tu participes activement. Continue sur cette voie !"
    },
    {
        "_id": 29,
        "_student_id": 20,
        "_subject_id": 1,
        "_date": "2025-03-08",
        "_content": "Élève qui montre de l'intérêt en Quran, mais parfois distrait en classe. Les devoirs sont faits, mais manquent de régularité. Continue à travailler pour progresser !"
    },
    {
        "_id": 30,
        "_student_id": 20,
        "_subject_id": 2,
        "_date": "2025-02-22",
        "_content": "Élève sérieux en Tajwid, mais les devoirs pourraient être plus soignés. Tes résultats sont corrects, concentre-toi davantage pour améliorer tes performances !"
    },
    {
        "_id": 31,
        "_student_id": 21,
        "_subject_id": 1,
        "_date": "2025-03-15",
        "_content": "Élève sérieux et concentré en Quran. Les devoirs sont bien faits, et les résultats sont excellents. Continue sur cette lancée, c'est impressionnant !"
    },
    {
        "_id": 32,
        "_student_id": 21,
        "_subject_id": 1,
        "_date": "2025-03-02",
        "_content": "Élève appliqué en Nourania, avec de bons résultats. Les devoirs sont bien faits, et tu progresses bien. Continue ainsi, c'est encourageant !"
    },
    {
        "_id": 33,
        "_student_id": 22,
        "_subject_id": 2,
        "_date": "2025-03-01",
        "_content": "Élève qui peut être distrait en Tajwid. Les devoirs sont parfois négligés, ce qui impacte tes résultats. Concentre-toi davantage, tu as du potentiel !"
    },
    {
        "_id": 34,
        "_student_id": 22,
        "_subject_id": 2,
        "_date": "2025-02-16",
        "_content": "Élève qui montre de l'intérêt en Éveil à la Foi, mais manque parfois de concentration. Les devoirs sont faits, mais pourraient être plus soignés. Ne relâche pas tes efforts !"
    },
    {
        "_id": 35,
        "_student_id": 23,
        "_subject_id": 2,
        "_date": "2025-03-15",
        "_content": "Élève appliqué et attentif en Tajwid. Les devoirs sont bien faits, et les résultats sont très bons. Continue ainsi, tes efforts portent leurs fruits !"
    },
    {
        "_id": 36,
        "_student_id": 23,
        "_subject_id": 2,
        "_date": "2025-03-05",
        "_content": "Élève sérieux et concentré en Langue Arabe. Les devoirs sont toujours bien faits, et les résultats sont excellents. Bravo, continue sur cette voie !"
    },
    {
        "_id": 37,
        "_student_id": 24,
        "_subject_id": 1,
        "_date": "2025-02-23",
        "_content": "Élève qui montre de l'intérêt en Nourania, mais manque parfois de concentration. Les devoirs sont faits, mais pourraient être plus soignés. Continue à travailler !"
    },
    {
        "_id": 38,
        "_student_id": 24,
        "_subject_id": 2,
        "_date": "2025-03-09",
        "_content": "Élève appliqué en Éveil à la Foi, avec de bons résultats. Les devoirs sont bien faits, et tu progresses bien. Continue sur cette lancée !"
    },
    {
        "_id": 39,
        "_student_id": 25,
        "_subject_id": 1,
        "_date": "2025-03-16",
        "_content": "Élève très sérieux et appliqué en Nourania. Les devoirs sont toujours bien faits, et les résultats sont excellents. Bravo, continue sur cette voie !"
    },
    {
        "_id": 40,
        "_student_id": 25,
        "_subject_id": 2,
        "_date": "2025-03-19",
        "_content": "Élève appliqué en Langue Arabe, avec de bons résultats. Les devoirs sont bien faits, et tu montres une bonne attitude en classe. Continue ainsi !"
    }
]